; domain
(define (domain irrigation_basic_domain)

(:requirements :strips :typing :fluents :negative-preconditions :universal-preconditions 
    :disjunctive-preconditions :conditional-effects :equality)

(:types crop depot - location robot)

(:predicates 
    (at ?r - robot ?l - location)
    (is-priority ?c - crop)
    (connected ?l1 ?l2 - location)
    (sacrificed ?c - crop)
    (needs_check)

)

(:functions
    (moisture_level ?c - crop)
    (water_supply ?r - robot)
    (num_sacrificed)
)

(:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (at ?r ?from) (connected ?from ?to) (not (needs_check)))
    :effect (and (at ?r ?to) (not (at ?r ?from)))
)


(:action irrigate
    :parameters (?r - robot ?c - crop)
    :precondition (and (at ?r ?c) (is-priority ?c) (> (water_supply ?r) 0) (< (moisture_level ?c) 50))
    :effect (and (increase (moisture_level ?c) 10) (decrease (water_supply ?r) 10) (needs_check))
)

(:action check_levels
    :parameters (?c - crop ?r - robot)
    :precondition (and
        (> (water_supply ?r) 0)
        (forall (?other - crop) (>= (moisture_level ?other) (moisture_level ?c)))
    )
    :effect (and
        (is-priority ?c)
        (not (needs_check))
        (forall (?other - crop)
            (when (not (= ?other ?c)) (not (is-priority ?other)))
        )
    )
)


(:action sacrifice
    :parameters (?c - crop ?r - robot)
    :precondition (and (= (water_supply ?r) 0) (not (sacrificed ?c)))
    :effect (and (sacrificed ?c) (increase (num_sacrificed) 1))
)

)

; problem
(define (problem irrigation_limited_problem) 

(:domain irrigation_basic_domain)

(:objects robot1 - robot
          c1 c2 c3 c4 c5 c6 - crop
          start1 - depot
)

(:init

    (= (water_supply robot1) 80)
    (= (num_sacrificed) 0)
    (needs_check)

    (at robot1 start1)
    (connected start1 c1)
    (connected c1 start1)
    (connected c1 c2)
    (connected c2 c1)
    (connected c1 c4)
    (connected c4 c1)
    (connected c2 c3)
    (connected c3 c2)
    (connected c2 c5)
    (connected c5 c2)
    (connected c6 c3)
    (connected c3 c6)
    (connected c6 c5)
    (connected c5 c6)
    (connected c4 c5)
    (connected c5 c4)

    (= (moisture_level c1) 17)
    (= (moisture_level c2) 63)
    (= (moisture_level c3) 42)
    (= (moisture_level c4) 88)
    (= (moisture_level c5) 5)
    (= (moisture_level c6) 71)

)

(:goal (and
    (forall (?c - crop) (or (>= (moisture_level ?c) 50) (sacrificed ?c)))
))

(:metric minimize (num_sacrificed))

)

; plan
1. (check_levels c5 robot1)
   deleted: (needs_check)
   added: (is-priority c5)
   goals met: 0 of 1
2. (move robot1 start1 c1)
   deleted: (at robot1 start1)
   added: (at robot1 c1)
   goals met: 0 of 1
3. (move robot1 c1 c4)
   deleted: (at robot1 c1)
   added: (at robot1 c4)
   goals met: 0 of 1
4. (move robot1 c4 c5)
   deleted: (at robot1 c4)
   added: (at robot1 c5)
   goals met: 0 of 1
5. (irrigate robot1 c5)
   added: (needs_check)
   changed: (moisture_level c5) from 5 to 15, (water_supply robot1) from 80 to 70
   goals met: 0 of 1
6. (irrigate robot1 c5)
   changed: (moisture_level c5) from 15 to 25, (water_supply robot1) from 70 to 60
   goals met: 0 of 1
7. (irrigate robot1 c5)
   changed: (moisture_level c5) from 25 to 35, (water_supply robot1) from 60 to 50
   goals met: 0 of 1
8. (check_levels c1 robot1)
   deleted: (needs_check) (is-priority c5)
   added: (is-priority c1)
   goals met: 0 of 1
9. (move robot1 c5 c2)
   deleted: (at robot1 c5)
   added: (at robot1 c2)
   goals met: 0 of 1
10. (move robot1 c2 c1)
   deleted: (at robot1 c2)
   added: (at robot1 c1)
   goals met: 0 of 1
11. (irrigate robot1 c1)
   added: (needs_check)
   changed: (moisture_level c1) from 17 to 27, (water_supply robot1) from 50 to 40
   goals met: 0 of 1
12. (irrigate robot1 c1)
   changed: (moisture_level c1) from 27 to 37, (water_supply robot1) from 40 to 30
   goals met: 0 of 1
13. (check_levels c5 robot1)
   deleted: (needs_check) (is-priority c1)
   added: (is-priority c5)
   goals met: 0 of 1
14. (move robot1 c1 c2)
   deleted: (at robot1 c1)
   added: (at robot1 c2)
   goals met: 0 of 1
15. (move robot1 c2 c5)
   deleted: (at robot1 c2)
   added: (at robot1 c5)
   goals met: 0 of 1
16. (irrigate robot1 c5)
   added: (needs_check)
   changed: (moisture_level c5) from 35 to 45, (water_supply robot1) from 30 to 20
   goals met: 0 of 1
17. (irrigate robot1 c5)
   changed: (moisture_level c5) from 45 to 55, (water_supply robot1) from 20 to 10
   goals met: 0 of 1
18. (check_levels c1 robot1)
   deleted: (needs_check) (is-priority c5)
   added: (is-priority c1)
   goals met: 0 of 1
19. (move robot1 c5 c2)
   deleted: (at robot1 c5)
   added: (at robot1 c2)
   goals met: 0 of 1
20. (move robot1 c2 c1)
   deleted: (at robot1 c2)
   added: (at robot1 c1)
   goals met: 0 of 1
21. (irrigate robot1 c1)
   added: (needs_check)
   changed: (moisture_level c1) from 37 to 47, (water_supply robot1) from 10 to 0
   goals met: 0 of 1
22. (sacrifice c3 robot1)
   added: (sacrificed c3)
   changed: (num_sacrificed) from 0 to 1
   goals met: 0 of 1
23. (sacrifice c1 robot1)
   added: (sacrificed c1)
   changed: (num_sacrificed) from 1 to 2
   goals met: 1 of 1
